Revit 2026 API

# SiteLocationPlaceName Property

---

The place name of the site.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public string PlaceName { get; set; }
```
```vb
Public Property PlaceName As String
	Get
	Set
```
```cpp
public:
property String^ PlaceName {
	String^ get ();
	void set (String^ value);
}
```
```fsharp
member PlaceName : string with get, set
```

#### Property Value

String

| Exception | Condition |
| --- | --- |
| ArgumentNullException | When setting this property: A non-optional argument was null |

#### Reference

SiteLocation Class

Autodesk.Revit.DB Namespace